{
  "jobs": [
    {
      "id": 1,
      "title": "Financial Advisor",
      "company": "CUSTODIAN LIFE ASSURANCE LIMITED",
      "department": "sales",
      "location": "Lagos",
      "type": "Full Time",
      "Industry": "Banking, Finance & Insurance",
      "salary": "Confidential",
      "Job Summary": "Custodian Life Assurance Limited (formerly Crusader Life Insurance Limited) is a specialist life insurance company incorporated in Nigeria and licensed by the National Insurance Commission to transact all classes of life insurance business. We are looking to hire a financial advisor to join our team. You will spend your day talking to clients about their financial objectives and risk tolerance and then recommend an appropriate financial planning strategy.",
      "Minimum Qualification": "OND",
      "Experience Level": "Entry level",
      "Experience Length": "No Experience/Less than 1 year",
      "Job Description": "The Qualified Candidate would Demonstrate the following and more: Organizing sales visits, Demonstrating and presenting products, Establishing new business, Maintaining accurate records, Attending trade exhibitions, conferences, and meetings, Reviewing sales performance, Negotiating contracts and packages, Aiming to achieve monthly or annual targets."
    },
    {
      "id": 2,
      "title": "Driver",
      "company": "Rest of Nigeria (Edo)",
      "department": "sales",
      "location": "Benin",
      "type": "Full Time",
      "Industry": "Transport & Logistics",
      "salary": "Confidential",
      "Job Summary": "A manufacturing firm seeks qualified candidates to fill this role",
      "Minimum Qualification": "High School (S.S.C.E)",
      "Experience Level": "Entry level",
      "Experience Length": "1 year",
      "Job Description": "Map out driving routes ahead of time to determine the most expedient trip, Pick up clients from the place and at the time they’ve requested, Collect payments and issue receipts, Assist clients with loading and unloading their luggage, Listen to traffic and weather reports to stay up-to-date on road conditions, Adjust the route to avoid heavy traffic or road constructions, as needed, Answer clients’ questions about the area and local places of interest, Ensure the car seats are clean and comfortable for all riders, Schedule regular car service appointments and report any issues, Book car wash and detailing services to maintain interior and exterior cleanliness of the car"
    },
    {
      "id": 3,
      "title": "Marketing Executive",
      "company": "Custodian Life Assurance",
      "department": "Management & Business Development",
      "location": "Lagos",
      "type": "Full Time",
      "Industry": "Banking, Finance & Insurance",
      "salary": "Confidential",
      "Job Summary": "Custodian and Allied Plc. (CA Plc) is a holding company with leading specialist companies and brands including Custodian and Allied Insurance Limit...",
      "Minimum Qualification": "OND",
      "Experience Level": "Graduate trainee",
      "Experience Length": "1 year",
      "Job Description": "Custodian and Allied Plc. (CA Plc) is a holding company with leading specialist companies and brands including Custodian and Allied Insurance Limited, Custodian Life Assurance Limited, Custodian Trustees Limited and Crusader Sterling Pensions Limited; all rendering best in class services in its versatile fold. Job Description: Planning, developing and implementing effective marketing communication campaigns., Using the full marketing mix for the company’s marketing communications, Writing copy for all marketing collateral, including brochures, letters, emails and websites., Understanding the product and customer profile and write thorough specs for each., Monitoring ongoing campaign spend against the budget, keeping accurate records and highlighting where variances occur., Producing an accurate summary of total spend at the end of a marketing campaign., Undertaking detailed ongoing analysis of marketing campaigns to ensure targets are met., Assisting in the production of ongoing competitor analysis and reporting, with particular reference to pricing, presentation and promotion."
    },
    {
      "id": 4,
      "title": "Motion Graphics Artist/Editor",
      "company": "Confidential",
      "department": "Creative & Design",
      "location": "Lagos",
      "type": "Full Time",
      "Industry": "Recruitment",
      "salary": "Confidential",
      "Job Summary": "One of our clients is seeking qualified candidates to fill this role",
      "Minimum Qualification": "Degree",
      "Experience Level": "Mid level",
      "Experience Length": "4 years",
      "Job Description": "Reports to Post-Production Supervisor Position Type Full Time, Works within the Post-production team to create eye-catching motion graphics for Elevation church different platforms., Assist in selecting audio, video, colors, animation, etc for graphic design., Motion Graphics, Design and create enticing motion graphics for video deliverables, marketing demos, Prepare design plan, concept and layout for motion graphic  project., Research and analyze best design techniques and solutions to create motion graphics., Assist in designing and creating storyboards., Videography, Shoot video production footage and B-roll."
    },
    {
      "id": 5,
      "title": "AUTOMATION ENGINEER",
      "company": "Confidential",
      "department": "Engineering",
      "location": "Rest of Nigeria (Enugu)",
      "type": "Full Time",
      "Industry": "Recruitment",
      "salary": "Confidential",
      "Job Summary": "One of our clients is seeking qualified candidates to fill this role",
      "Minimum Qualification": "Degree",
      "Experience Level": "Mid level",
      "Experience Length": "5 years",
      "Job Description": "Member of a technical team comprising the production, maintenance, quality and continuous improvement elements., To keep updated and safe the equipment's software of the company., To follow-up the preventive maintenance of the electrical equipment, To train the technician and production staff, To trouble shoot whenever necessary, To suggest and implement modification on the equipment (program, electrical cabling and/or mechanical set-up), Whenever necessary, participate in the specification, planning and setting up of projects for the installation of new equipment or their modification /replacement., Responsible for the respect and implementation of the highest standard in health and safety."
    },
    {
      "id": 6,
      "title": "Associate",
      "company": "Adesec Recuiters",
      "department": "Legal Services",
      "location": "Lagos",
      "type": "Full Time",
      "Industry": "Law",
      "salary": "75,000 - 150,000",
      "Job Summary": "To work as a corporate commercial solicitor in a dynamic law firm with passion for results",
      "Minimum Qualification": "Degree",
      "Experience Level": "Mid level",
      "Experience Length": "2 years",
      "Job Description": "Preparing commercial agreements, Attending meetings with clients, Setting up and facilitating Annual General Meetings and Board Meetings, Land transactions and perfection of titles at registries across different state jurisdictions"
    },
    {
      "id": 7,
      "title": "Operations Officer",
      "company": "Anonymous Employer",
      "department": "Administrative & Office",
      "location": "Lagos",
      "type": "Full Time",
      "Industry": "Retail, Fashion & FMCG",
      "salary": "75,000 - 150,000",
      "Job Summary": "Operations Officer to handle day-to-day office, administrative and HR duties for a fast-growing natural hair and skincare products company.",
      "Minimum Qualification": "HND",
      "Experience Level": "Mid level",
      "Experience Length": "4 years",
      "Job Description": "A prominent natural hair and skincare products manufacturer and retailer based in Lekki Phase 1, Lagos, is in need of an Operations Officer to handle day-to-day administrative and general management functions. These include; Managing day-to-day operations, Interviewing and hiring of junior staff, Dealing with suppliers, Generating daily/weekly sales reports, Preparing monthly payroll"
    }
  ],
  
  "users" : [
      {
          "id": 1,
          "username": "Admin",
          "password": "administrator"
      }
  ]
}